Repository: Asma111-dot/booking-guide-flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

# about_facility
source: Facility overview
ar: لمحة عن المنشأة

source: Accept
ar: قبول

# access_time
source: Time
ar: الوقت

source: Account created successfully.
ar: تم إنشاء الحساب بنجاح.

source: Address
ar: العنوان

# address_like
source: Facility Address
ar: عنوان المنشأة

# address_near_user
source: Nearby Location
ar: موقع قريب منك

source: Address not available
ar: عنوان غير متوفر

source: Address (optional)
ar: العنوان (اختياري)

# adults_count
source: Number of Adults
ar: عدد الكبار

# adults_hint
source: Specify the number of adults attending.
ar: حدد عدد الأشخاص البالغين الذين سيحضرون؟

# agreeToTerms
source: I agree to the terms and conditions
ar: أوافق على الشروط والأحكام

source: All
ar: الكل

source: All available chalets
ar: جميع الشاليهات المتوفرة

# all_available_halls
source: All available wedding halls
ar: جميع قاعات الأعراس المتوفرة

source: All available hotels
ar: جميع الفنادق المتوفرة

# amenities_and_facilities
source: Amenities
ar: وسائل الراحة

# amenity
source: Amenities
ar: المرافق

source: Amount to be paid
ar: المبلغ المستوجب دفعة

# appTitle
source: My Booking
ar: حجوزاتي

source: Apply Filter
ar: تطبيق الفلترة

source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Are you sure?
ar: هل أنت متأكد؟

source: Attendance Type
ar: نوع الحضور

# availabilityCalendar
source: Choose Package & Date
ar: قائمة الحجوزات

source: available
ar: المتوفرة

# available_on_day
source: Availability by Day
ar: التوفر حسب اليوم

source: Available spaces
ar: المساحات المتوفرة

source: Booking
ar: الحجوزات

# bookingNow
source: Book Now
ar: احجز الأن

# booking_not_confirmed_warning
source: Note: The reservation is not confirmed until payment is completed. The deposit amount is non-refundable.
ar: تنبيه: الحجز غير مؤكد إلا بعد الدفع. والمبلغ (العربون) غير قابل للاسترجاع.

source: Booking Type
ar: نوع الحجز

# booking_type_hint
source: Please select the appropriate booking type (Family / Women / Men / Company)
ar: يرجى اختيار نوع الحجز المناسب

source: Button
ar: زر

source: By proceeding, you agree to the
ar: بالمتابعة، أنت توافق على

source: Cancel
ar: إلغاء

source: Cancelled
ar: ملغي

source: capacity
ar: السعة

# capacity_at_least
source: Minimum Capacity
ar: الحد الأدنى للأشخاص

source: Chalet
ar: شاليهات

source: Chalet Name
ar: اسم الشالية

# chalet_sorted_by_highest_price
source: Chalets sorted by highest price
ar: الشاليهات مرتبة حسب السعر من الأعلى إلى الأقل

# chalet_sorted_by_lowest_price
source: Chalets sorted by lowest price
ar: الشاليهات مرتبة حسب السعر من الأقل إلى الأعلى

# checkYourInternetConnectionOrTryAgain
source: Please check your internet connection or try again.
ar: تحقق من اتصال الإنترنت أو حاول مرة أخرى.

# check_in_between
source: Check-in Date
ar: تاريخ الوصول

source: Check-in Date
ar: تاريخ الدخول

source: Check-out Date
ar: تاريخ الخروج

# children_count
source: Number of Children
ar: عدد الأطفال

# children_hint
source: Specify the number of children (optional – only if applicable)
ar: حدد عدد الأطفال (اختياري – فقط إذا كان هناك أطفال)

# chooseOne
source: Choose one of the options to enjoy the application services
ar: قم باختيار أحد الخيارات للتمتع بخدمات التطبيق

source: Choose filter type
ar: اختر نوع الفلتر

# close_and_go_back
source: Close
ar: إغلاق

# companies
source: Company
ar: شركة

# completeProfile
source: Complete Your Profile
ar: استكمال البيانات الشخصية

source: Complete the reservation
ar: إتمام الحجز

source: Confirm new password field is required.
ar: حقل تأكيد كلمة المرور الجديدة مطلوب.

source: Confirm Payment
ar: تأكيد الدفع

source: Confirmed
ar: مؤكد

source: Contact Details
ar: تفاصيل جهة الاتصال

source: Contacts
ar: جهات الاتصال

source: Continue Booking
ar: إستكمال الحجز

# created_at
source: Booking Date
ar: تاريخ الطلب

source: Dark Mode
ar: وضع الليل

source: Date Not Available
ar: التاريخ غير متاح

# day_1
source: day
ar: يوم

# day_11_plus
source: {count} days
ar: {count} يومًا

# day_2
source: 2 days
ar: يومين

# day_3_10
source: {count} days
ar: {count} أيام

source: Delete Account
ar: حذف الحساب

# delete_account_confirmation
source: Do you really want to delete the account?
ar: هل تريد فعلاً حذف حسابك؟ لا يمكن التراجع.

source: Deposit
ar: العربون

# desc_address_like
source: Find facilities based on keywords in their address.
ar: اعثر على منشآت بناءً على كلمات موجودة في العنوان.

# desc_address_near_user
source: Find facilities closest to your specified address.
ar: اعثر على المنشآت الأقرب بناءً على عنوانك المحدد.

# desc_available_on_day
source: View facilities available for booking on a selected day.
ar: اعرض المنشآت المتاحة للحجز في يوم معين تختاره.

# desc_capacity_at_least
source: Find facilities that can accommodate at least a specified number of people.
ar: ابحث عن منشآت تستوعب عددًا لا يقل عن عدد معين من الأشخاص.

# desc_check_in_between
source: View facilities available during a specific check-in package.
ar: اعرض المنشآت المتوفرة ضمن باقة وصول محددة.

# desc_facility_type_id
source: Choose the facility category such as hotel, chalet, or event hall to filter results.
ar: اختر تصنيف المنشأة مثل فندق، شاليه، قاعة مناسبات لتسهيل البحث.

# desc_name
source: Search for facilities by typing part of their name.
ar: ابحث عن منشآت عبر كتابة اسمها او جزء من منها.

# desc_price_between
source: Select a minimum and maximum price to display suitable facilities.
ar: اختر الحد الأدنى والأقصى للسعر لعرض المنشآت المناسبة.

source: Description
ar: الوصف

source: Discount Value
ar: قيمة الخصم

# discounts_and_offers
source: Discounts & Offers
ar: الخصومات والعروض

# discoverBestPlace
source: Discover the best place for your needs
ar: اكتشف أفضل مكان يناسب احتياجاتك

# doYouForgetYourPassword
source: Forgot your password?
ar: هل نسيت كلمة المرور؟

source: Edit Profile
ar: تعديل الملف الشخصي

source: Edit Personal Data
ar: تعديل البيانات الشخصية

source: Email
ar: البريد الإلكتروني

source: Email field is required.
ar: حقل البريد الإلكتروني مطلوب.

# enter_code2_from_wallet
source: Enter the code received from Jawali Wallet
ar: أدخل الكود المستلم من محفظة جوالي

# enter_code_from_wallet
source: Enter the code received from Jaib Wallet
ar: أدخل الكود المستلم من محفظة جيب

source: Enter confirmation number
ar: أدخل رقم التأكيد

# enter_current_address
source: Enter your current address
ar: أدخل عنوانك الحالي

source: Enter payment code
ar: إدخال كود الدفع

# enter_verification_code_message
source: Please enter the verification code sent via WhatsApp.
ar: يرجى إدخال رمز التحقق الذي تم إرساله إلى رقم هاتفكم.

source: Error
ar: خطأ

# errorOccurred
source: An error occurred, please try again
ar: حدث خطأ، يرجى المحاولة مرة أخرى

# error_occurred_during_save
source: An error occurred during saving
ar: حدث خطأ أثناء الحفظ

# facilityTypes
source: Facilities
ar: المنشئات

# facility_type_id
source: Facility Category
ar: تصنيف المنشأة

# family
source: Family(Man and Women)
ar: عائلي(نساء ورجال)

source: Favorite
ar: المفضلة

source: Floosak
ar: فلوسك

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Full Name
ar: الاسم الكامل

# go_back
source: Back and return
ar: تراجع والعودة

# hall
source: Wedding Hall
ar: قاعة أعراس

# hall_sorted_by_highest_price
source: Wedding halls sorted by highest price
ar: قاعات الأعراس مرتبة حسب السعر من الأعلى إلى الأقل

# hall_sorted_by_lowest_price
source: Wedding halls sorted by lowest price
ar: قاعات الأعراس مرتبة حسب السعر من الأقل إلى الأعلى

# hello_user
source: Hello,
ar: مرحباً,

source: Hotel
ar: فنادق

# hotel_sorted_by_highest_price
source: Hotels sorted by highest price
ar: الفنادق مرتبة حسب السعر من الأعلى إلى الأقل

# hotel_sorted_by_lowest_price
source: Hotels sorted by lowest price
ar: الفنادق مرتبة حسب السعر من الأقل إلى الأعلى

source: Image Gallery
ar: معرض الصور

# insurance_coverage_question
source: Property Insurance
ar: ما الذي يشمله التأمين؟

source: Invalid credentials.
ar: بيانات الاعتماد غير صالحة.

source: Language
ar: اللغة

# language_desc
source: Select your preferred language
ar: اختيار اللغة المفضلة

source: Light Mode
ar: وضع النهار

source: Loading...
ar: جاري التحميل...

source: Login
ar: تسجيل الدخول

# loginFailed
source: Login failed. Please check your credentials.
ar: فشل تسجيل الدخول. يرجى التحقق من بيانات الاعتماد الخاصة بك.

source: Login successful.
ar: تم تسجيل الدخول بنجاح.

# login_subtitle
source: Start your journey with us and log in to My Booking app.
ar: ابدأ رحلتك معنا، وسجّل الدخول إلى تطبيق حجوزاتي.

source: Logout
ar: تسجيل الخروج

# logout_desc
source: Sign out of your account
ar: الخروج من حسابك الحالي

source: Map
ar: الخريطة

# mapHint
source: View all facilities on the map and pick your destination easily.
ar: شاهد كل المنشآت على الخريطة وحدد وجهتك بسهولة.

# max_price
source: Maximum Price
ar: أعلى سعر

# men
source: Men Only
ar: رجال فقط

# min_price
source: Minimum Price
ar: أقل سعر

# name
source: Facility Name
ar: اسم المنشأة

source: Name field is required.
ar: حقل الاسم مطلوب.

source: New Contact
ar: جهة اتصال جديدة

source: New password field is required.
ar: حقل كلمة المرور الجديدة مطلوب.

source: Next
ar: التالي

source: No
ar: لا

# noAmenities
source: No Amenity Available
ar: لا يوجد المرافق متاح حالياَ

# noChalet
source: There are no chalets available at the moment.
ar: لا توجد شاليهات متاحة حالياً.

source: No facility types available
ar: لا توجد أنواع مرافق متاحة

# noFavorites
source: No favorite facilities yet
ar: لا توجد منشآت مفضلة حتى الآن

# noHotel
source: There are no hotels available at the moment.
ar: لا توجد فنادق متاحة حالياً.

# noReservations
source: No reservations at the moment
ar: لا توجد حجوزات حالياً

# noReservationsHint
source: Explore venues and make a reservation now.
ar: ابدأ باستكشاف المنشآت واحجز موعدك الآن.

# no_facilities
source: No facilities available right now.
ar: لا توجد منشآت متاحة حالياً.

# no_data
source: No Data Available
ar: لا توجد بيانات متاحة حالياً.

# noNotifications
source: No notifications at the moment.
ar: لا توجد إشعارات حالياً

# noNotificationsHint
source: We'll let you know here as soon as anything new arrives.
ar: سنخبرك هنا بكل جديد فور وصوله.

source: No facilities available
ar: لا توجد منشآت متاحة

# no_images
source: No images available
ar: لا توجد صور

# no_matching_facilities
source: No facilities match your search
ar: لا توجد منشآت مطابقة للبحث

# no_rooms_available
source: No details available for this facility
ar: لا توجد تفاصيل متوفرة لهذه المنشأة

# notMatchedWithNewPassword
source: Does not match with new password.
ar: غير متطابق مع كلمة المرور الجديدة.

source: Not Available
ar: غير متوفر

source: Notifications
ar: الإشعارات

source: Number of days
ar: عدد الأيام

source: Off
ar: إيقاف

source: On
ar: تشغيل

source: on date:
ar: في تاريخ:

source: Other Details
ar: تفاصيل أخرى

# otp_code
source: Verification Code
ar: رمز التحقق

source: Paid Amount
ar: المبلغ المدفوع

source: Password
ar: كلمة المرور

source: Password field is required.
ar: حقل كلمة المرور مطلوب.

# passwordResetLinkSent
source: A password reset link has been sent to your email.
ar: تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني.

source: Passwords do not match.
ar: كلمتا المرور غير متطابقتين.

# payment
source: Complete Payment
ar: إتمام الدفع

source: Payment confirmed successfully!
ar: تم تأكيد الدفع بنجاح!

source: Payment Date
ar: تاريخ الدفع

source: Payment Details
ar: تفاصيل الدفع

source: Payment Methods
ar: وسائل الدفع

source: Payment Now
ar: الدفع الان

# people_count
source: Number of people
ar: عدد الأشخاص

source: Package
ar: الباقة

source: Personal Data
ar: البيانات الشخصية

# personal_data_desc
source: View or edit your personal information
ar: عرض أو تعديل بياناتك الشخصية

source: Persons
ar: الحساب

source: Phone field accepts digits only.
ar: حقل الهاتف يقبل الأرقام فقط.

source: Phone field is required.
ar: حقل الهاتف مطلوب.

source: Phone Number
ar: رقم الهاتف

# pick_from_camera
source: Take from camera
ar: التقاط من الكاميرا

source: Pick from gallery
ar: اختيار من المعرض

# pleaseAcceptTheTerms
source: Please accept the terms and conditions.
ar: يرجى قبول الشروط والأحكام.

source: Please check your email for verification.
ar: يرجى التحقق من بريدك الإلكتروني لتأكيد الحساب.

source: Please enter your email.
ar: يرجى إدخال بريدك الإلكتروني.

source: Please enter your password.
ar: يرجى إدخال كلمة المرور.

# please_choose_booking_type
source: Please choose the booking type
ar: الرجاء اختيار نوع الحجز

# please_complete_data_correctly
source: Please complete the data correctly
ar: الرجاء إكمال البيانات بشكل صحيح

# please_enter_adults_count
source: Please enter the number of adults
ar: الرجاء إدخال عدد الكبار

# please_enter_children_count
source: Please enter the number of children
ar: الرجاء إدخال عدد الأطفال

source: Please log in first
ar: يرجى تسجيل الدخول أولاً

source: Please wait...
ar: يرجى الانتظار...

# policies
source: Privacy Policy
ar: سياسة الخصوصية

# policies_desc
source: Learn how we handle your personal data and protect your privacy.
ar: اطلع على كيفية تعاملنا مع بياناتك الشخصية وحماية خصوصيتك.

source: Price
ar: السعر

# priceNotAvailable
source: Price not availablxe
ar: السعر غير متوفر

source: Price start from:
ar: يبدأ السعر من:

# price_between
source: Price Range
ar: نطاق الأسعار

# price_list
source: Prices
ar: الأسعار

source: Profile
ar: الملف الشخصي

# profileUpdateFailed
source: Profile update failed. Please try again.
ar: فشل تحديث الملف الشخصي. يرجى المحاولة مرة أخرى.

source: Profile updated successfully.
ar: تم تحديث الملف الشخصي بنجاح.

# question_description
source: Please select the day you would like to book. If the selected day is not available, please choose another day.
ar: يرجى تحديد اليوم أو الأيام التي ترغب في الحجز فيها. إذا لم تكن التواريخ المحددة متاحة، يرجى اختيار تواريخ أخرى.

# question_title
source: Select the day(s) you want to book
ar: اختر اليوم أو الأيام التي ترغب في الحجز فيها

source: Read more
ar: قراءة المزيد

# read_terms_before_booking
source: Facility Policies
ar: قبل أن تحجز... اقرأ هذه السياسات

source: Reject
ar: رفض

source: Remaining Amount
ar: المبلغ المتبقي

# remove_from_favorites_confirm
source: Are you sure you want to remove this facility from your favorites?
ar: هل أنت متأكد من إزالة المنشأة من المفضلة؟

source: Reservation Details
ar: تفاصيل الحجز

source: Reservation Date
ar: تاريخ الحجز

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Reset Filters
ar: إعادة تعيين الفلترة

# riyalY
source: R.Y
ar: ر.ي

source: Save
ar: حفظ

source: Search
ar: بحث

# searchByNameAddress
source: Search by name or address, specify the number of people, select the suitable date, and sort results by price easily.
ar: ابحث بالاسم أو العنوان، حدّد عدد الأشخاص، اختر التاريخ المناسب، ورتب النتائج حسب السعر بكل سهولة.

source: Search in facilities...
ar: بحث في المنشآت...

source: Select Date And Price
ar: اختيار الايام والسعر

source: Select Language
ar: اختر اللغة

source: Select Availability Day
ar: حدد يوم التوفر

source: Select Date
ar: اختر التاريخ

# select_people_count
source: Select the number of people
ar: حدد عدد الأشخاص

# select_period_and_day
source: Select your preferred period from the displayed price list and choose the day that suits you.
ar: حدد الفترات التي تناسبك من خلال قائمة الأسعار المعروضة، واختر اليوم أو الأيام التي ترغب في الحجز خلالها.

source: Select price range
ar: حدد نطاق السعر

source: Settings
ar: الإعدادات

# settings_desc
source: Change Language
ar: تغيير اللغة

source: Share
ar: مشاركة

# share_app
source: 📲 Share the app with your loved ones...
ar: 📲 شارك التطبيق مع من تحب....️

# share_app_message
source: Try our new booking app now!
ar: جرب تطبيقنا الجديد للحجوزات الآن!

# share_subject
source: Amazing app! Try it now 👇
ar: تطبيق رائع! جرّبه الآن 👇

source: Show available days
ar: عرض الأيام المتاحة

source: Show Facilities
ar: عرض المنشآت

# show_discount_details
source: View applied discount details
ar: عرض تفاصيل الخصومات المطبقة

source: Show less
ar: عرض أقل

source: Special services & amenities
ar: الخدمات والمرافق المميزة

source: status
ar: الحالة

source: Submit
ar: إرسال

source: Success
ar: نجاح

# support
source: Support & Contact
ar: التواصل والدعم

# support_desc
source: Contact us for any inquiry or issue
ar: تواصل معنا لأي استفسار أو مشكلة

# support_message
source: We value your feedback and suggestions, and we welcome any communication through the following channels to enhance your experience.
ar: نقدّر ملاحظاتكم واقتراحاتكم، ونرحب بأي تواصل من خلال القنوات التالية لتحسين تجربتكم.

# terms
source: Please read the terms and conditions carefully before using the application. By using this application, you agree to abide by these terms.
ar: يرجى قراءة الشروط والأحكام بعناية قبل استخدام التطبيق. باستخدامك لهذا التطبيق، فإنك توافق على الالتزام بهذه الشروط.

source: Terms and Conditions
ar: الشروط والأحكام

source: Terms of Use
ar: شروط الاستخدام

source: This field accepts digits only.
ar: هذا الحقل يقبل الأرقام فقط.

source: This field is required.
ar: هذا الحقل مطلوب.

source: This is not a valid email.
ar: هذا ليس بريدًا إلكترونيًا صالحًا.

source: to
ar: في

source: Total price
ar: إجمالي السعر

# ultimateDestination
source: Your ultimate destination for reservations
ar: وجهتك النهائية للحجوزات

source: Unable to open phone app.
ar: غير قادر على فتح تطبيق الهاتف.

# unauthorizedMessage
source: You do not have permission to view this content.
ar: ليس لديك إذن لعرض هذا المحتوى.

source: Update Profile
ar: تحديث الملف الشخصي

# userNotFound
source: User not found with this email.
ar: لم يتم العثور على مستخدم بهذا البريد الإلكتروني.

source: Using system settings
ar: استخدام إعدادات النظام

source: Verify
ar: تأكيد

source: View Facility Details
ar: استعراض تفاصيل المنشأة

# view_price_list
source: Chooses to a available price list to choose what package suits you best
ar: اختر من قائمة الأسعار المتاحة واختيار الباقة الأنسب لك

source: Welcome
ar: مرحباً

# welcomeToBooking
source: Welcome to my booking
ar: مرحبا بك في

# women
source: Women Only
ar: نساء فقط

source: Yes
ar: نعم

source: You are not connected to the internet.
ar: أنت غير متصل بالإنترنت.

# searchFieldLabel
source: Search by facility name
ar: ابحث باسم المنشأة

# no_matching_facilities_title
source: No matching facilities
ar: لا توجد منشآت مطابقة

# no_matching_facilities_subtitle
source: We couldn't find any facilities in the current search results. Try entering a different name or explore the map in another area.
ar: لم نعثر على أي منشأة في نتائج البحث الحالية. جرّب كتابة اسم مختلف أو استكشف الخريطة في منطقة أخرى.

# onboarding1_subtitle
source: Start your journey with us by searching for the perfect chalet, hotel, or wedding hall, complete with photos and detailed information.
ar: ابدأ رحلتك معنا بالبحث عن الشاليه، الفندق أو قاعة الأفراح المثالية لك، مع صور ومعلومات تغنيك عن السؤال.

# onboarding2_subtitle
source: Choose what you like and set the date that suits you, so your place will be ready to welcome you at the perfect moment.
ar: اختر ما أعجبك وحدد الموعد الذي يناسبك، ليكون مكانك جاهزًا لاستقبالك في اللحظة التي تريدها.

# onboarding3_subtitle
source: Complete your booking from anywhere with easy and secure payment options, and get ready for an unforgettable experience.
ar: أكمل الحجز من مكانك بخيارات دفع سهلة وآمنة، واستعد لتجربة لا تُنسى.

# package_features_detailed
source: Detailed package features
ar: مميزات هذه الباقة بالتفصيل

source: amenities
ar: المزايا

source: size
ar: الحجم

# meter2
source: m²
ar: م²

# pleaseSelectPeriodAndPriceFirst
source: Please select a Package and choose a day first
ar: يرجى اختيار الباقة وتحديد اليوم أولاً

# manual_deposit_instruction
source: Please pay the deposit manually via Jaib and then enter the received code.
ar: يرجى دفع العربون يدويًا عبر جيب ثم إدخال الكود المستلم .

# list_your_facility
source: Showcase your facility on our platform
ar: اعرض منشأتك على موقعنا

# promote_your_facility
source: You can showcase any facility, whether it's a hotel, chalet, or hall, on our platform
ar: يمكنك عرض أي منشأة سواء فندقاً أو شاليهاً أو قاعة على منصتنا
